Tekla Open API Reference for Tekla Structures 2025
InsidePartHorizontalPlacingType Class
 The InsidePartHorizontalPlacingType class defines a placing type that places the object using the base line placing. The base line used is in the middle of the part, aligned with the part. In addition the object will be rotated to be horizontal in the drawing.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.PreferredPlacingTypeBase
 Tekla.Structures.Drawing.InsidePartHorizontalPlacingType
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class InsidePartHorizontalPlacingType : PreferredPlacingTypeBase
<SerializableAttribute>
Public Class InsidePartHorizontalPlacingType
	Inherits PreferredPlacingTypeBase
The InsidePartHorizontalPlacingType type exposes the following members.
Constructors
Name | Description
InsidePartHorizontalPlacingType
 Creates a new inside part horizontal placing type instance.
Top
See Also
Reference
Tekla.Structures.Drawing Namespace